In [2]:
import numpy as np
import pandas as pd

In [3]:
# 4.1.1

a = pd.Series([np.random.randint(10,100,4)], 
        index=['가','나','다','라'])
b = pd.Series([np.random.randint(10,100,4)], 
        index=['마','바','사','아'])

a, b

ValueError: Length of passed values is 1, index implies 4.

In [ ]:
# 4.1.2

In [4]:
# 4.1.3

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [5]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [6]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [7]:
df['평균'] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [8]:
df.values       #넘파이 배열로 나옴

array([[80.  , 90.  , 90.  , 86.67],
       [90.  , 70.  , 60.  , 73.33],
       [70.  , 60.  , 80.  , 70.  ],
       [30.  , 40.  , 70.  , 46.67]])

In [9]:
np.mean(df.values[:,:-1], axis=1).round(2)

array([86.67, 73.33, 70.  , 46.67])

In [11]:
df.drop(columns=['평균'], inplace=True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [13]:
df['영어']['방자'] = 80
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [14]:
df['평균'] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [15]:
# warning message 해제

import warnings
warnings.filterwarnings('ignore')

In [16]:
df.head(1)

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [17]:
df.head(3).tail(1)

    국어  영어  수학    평균
향단  70  60  80  70.0

In [18]:
df.T

       춘향     몽룡    향단    방자
국어  80.00  90.00  70.0  30.0
영어  90.00  70.00  60.0  80.0
수학  90.00  60.00  80.0  70.0
평균  86.67  73.33  70.0  60.0

In [21]:
df.T[['춘향']]

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [22]:
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [23]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

4.3.1

In [24]:
df=pd.DataFrame(np.arange(25).reshape(5,5), columns=list('ABCDE'), index=list('vwxyz'))
df

    A   B   C   D   E
v   0   1   2   3   4
w   5   6   7   8   9
x  10  11  12  13  14
y  15  16  17  18  19
z  20  21  22  23  24

In [25]:
df['C']['x'], df['C'][2], df.C['x'], df.C[2], df.C.x

(12, 12, 12, 12, 12)

In [26]:
# loc indexer
df.loc['x', 'C'], df.loc['x'][2], df.loc['x']['C']

(12, 12, 12)

In [27]:
#iloc indexer
df.iloc[2,2], df.iloc[2]['C'], df.iloc[2][2]

(12, 12, 12)